interface Category {
  label: string
  options: string[]
}

const categories: Category[] = [
  {
    label: '基本',
    options: [
      '数组',
      '字符串',
      '排序',
      '矩阵',
      '模拟',
      '枚举',
      '字符串匹配',
      '桶排序',
      '计数排序',
      '基数排序'
    ]
  },
  {
    label: '算法',
    options: [
      '动态规划',
      '贪心',
      '深度优先搜索',
      '二分查找',
      '广度优先搜索',
      '回溯',
      '递归',
      '分治',
      '记忆化瘦身',
      '归并排序',
      '快速旋转'
    ]
  },
  {
    label: '基础数据结构',
    options: [
      '哈希表',
      '数',
      '二叉树',
      '栈',
      '堆 (优先队列)',
      '图',
      '链表',
      '单调栈',
      '有序集合',
      '二叉搜索树',
      '队列',
      '拓扑排序',
      '最短路',
      '单调队列',
      '双向链表',
      '最小生成树',
      '强连通分量',
      '欧拉回路',
      '双连通分量'
    ]
  },
  {
    label: '高级数据结构',
    options: ['并查集', '字典树', '线段树', '树状数组', '后缀数组']
  },
  {
    label: '技巧',
    options: [
      '双指针',
      '位运算',
      '前缀和',
      '滑动窗口',
      '计数',
      '状态压缩',
      '哈希函数',
      '滚动哈希',
      '扫描线'
    ]
  },
  {
    label: '数学',
    options: ['数学', '数论', '几何', '组合']
  },
  {
    label: '其他',
    options: ['数据库', '设计', '数据流', '脑筋急转弯', '交互', '迭代器', '多线程', 'Shell']
  }
]

export default categories
